package homework_17.HW.repetition;

// Программа просит пользователя ввести строку
//“/|\’Hello’ ‘World’\|/ @*#&$%^_+-{[xx]} !”
//Если пользователь вводит строку правильно, то программа распечатывает на экран благодарность и завершает работу.
//Если вводится неверная строка, то программа просит ввести строку снова, до тех пор, пока у пользователя это не получится.
//Дополнительно: считать кол-во попыток, которые потребовались пользователю для введения правильной строки.
//По окончанию - вывести число попыток на экран.

public class String {
    public static void main(String[] args) {

    }
}
